# -----------------------
# Taps
# -----------------------
tap "oven-sh/bun"                  # Bun package manager
tap "withgraphite/tap"             # Graphite CLI

# -----------------------
# Core Utilities
# -----------------------
brew "git"                         # Version control
brew "gh"                          # GitHub CLI
brew "withgraphite/tap/graphite"   # Graphite PR tool
brew "vercel-cli"                  # Vercel deployment CLI
brew "git-filter-repo"             # Git history rewriting
brew "gnupg"                       # GPG key management
brew "pinentry-mac"                # Pinentry GUI for GPG
brew "openfortivpn"                # Fortinet VPN client
brew "sshpass"                     # Non-interactive ssh password auth
brew "ffmpeg"                      # Multimedia framework

cask "protonvpn"                   # Proton VPN client

# -----------------------
# Toolchains / Programming Languages
# -----------------------
brew "python@3.12"                 # Python 3.12
brew "uv"                          # Fast Python package manager
brew "ruff"                        # Python linter
brew "rustup-init"                 # Rust toolchain installer
brew "llvm"                        # LLVM (required for Rust)
brew "rust"                        # Rust (linked with rustup if needed)
brew "node"                        # Node.js runtime
brew "bun"                         # Bun runtime + package manager

# -----------------------
# Research / Academic Tools
# -----------------------
brew "scipy"                       # Scientific computing library
brew "jupyterlab"                  # Jupyter notebooks
cask "mactex-no-gui"               # TeX distribution without GUI apps
cask "latexit"                     # LaTeX equation editor
cask "zotero"                      # Reference manager
cask "bibdesk"                     # BibTeX manager
cask "skim"                        # PDF reader for research papers

# -----------------------
# Fonts
# -----------------------
cask "font-geist"
cask "font-geist-mono"
cask "font-new-york"
cask "font-sf-pro"
cask "font-sf-mono"
cask "font-sf-compact"
cask "font-libre-baskerville"
cask "font-stix-two-text"
cask "font-stix-two-math"
cask "font-jetbrains-mono-nerd-font"
cask "font-libertinus-math"

# -----------------------
# Productivity / Workflow
# -----------------------
cask "linear-linear"               # Linear issue manager
cask "ollama-app"                  # Local LLM runner
cask "syntax-highlight"            # QuickLook syntax highlighting

# -----------------------
# Code Editors / IDEs
# -----------------------
cask "visual-studio-code"          # VS Code

# -----------------------
# Design Tools
# -----------------------
cask "sketch@beta"                 # Design tool
cask "sf-symbols"                  # Apple SF Symbols app

# -----------------------
# CLI Tools / Enhancements
# -----------------------
brew "bottom"                      # System monitoring (htop-like)
brew "zoxide"                      # Smarter directory navigation
brew "fzf"                         # Fuzzy finder
cask "openinterminal"              # Open folder in terminal (Finder button)
brew "neofetch"                    # System info display
brew "ncdu"                        # Disk usage analysis
brew "gemini-cli"                  # Gemini CLI tool
brew "ghostscript"                 # PostScript/PDF interpreter
brew "pdf2svg"                     # Convert PDF pages to SVG

# -----------------------
# Mac App Store Apps
# -----------------------
mas "Telegram", id: 747648890      # Messaging
mas "WhatsApp", id: 310633997      # Messaging
mas "Darkroom", id: 953286746      # Photo editor
mas "1Blocker", id: 1365531024     # Ad/content blocker
mas "Hush", id: 1544743900         # Block cookie nags
mas "Vinegar", id: 1591303229      # Native YouTube player
mas "Coupert", id: 1531442936      # Coupon/discount finder
mas "Pause", id: 1599313358        # Microbreak reminders
mas "Tailscale", id: 1475387142    # Secure remote access

