tap "oven-sh/bun"

# Core Utilities
brew "git"
brew "gh" # GitHub CLI
brew "vercel-cli" 
brew "git-filter-repo" # Re-write git repo history 
brew "gnupg" # GPG key
brew "pinentry-mac"
brew "openfortivpn"
cask "protonvpn"
brew "sshpass"
brew "ffmpeg"

# Toolchains
brew "python@3.12"
brew "rustup-init"
brew "llvm" # Required for Rust
brew "rust" # Run "brew info rust" for instructions on linking rustup with brew
brew "uv" # Python package manager
brew "ruff" # Python linter

# Node.js & Front-End Development
brew "node"
brew "bun" # Package manager

# Research
brew "scipy"
brew "jupyterlab"
cask "mactex-no-gui"
cask "latexit"
cask "zotero"
cask "bibdesk"
cask "skim"

# Fonts
cask "font-geist"
cask "font-geist-mono"
cask "font-new-york"
cask "font-sf-pro"
cask "font-sf-mono"
cask "font-sf-compact"
cask "font-libre-baskerville"
cask "font-stix-two-text"
cask "font-stix-two-math"
cask "font-jetbrains-mono-nerd-font"
cask "font-libertinus-math"

# Productivity
cask "warp" # Better terminal
cask "linear-linear" # Issue manager

# Code Editors
cask "visual-studio-code"

# Design Tools
cask "sketch@beta"
cask "sf-symbols"

# CLI tools 
brew "bottom" # System monitoring
brew "zoxide" # Navigate filesystem faster
brew "fzf" # File finder
cask "openinterminal" # Finder button, opens directory in terminal
brew "neofetch" # System info
brew "ncdu" # Storage space analysis
cask "claude-code"

# Misc
cask "protonvpn"
cask "syntax-highlight" # Adds QuickLook support for source files
cask "mountain-duck" # Remote server access
cask "ollama-app"
brew "ykman" # Yubikey CLI manager
brew "ghostscript" # Interpreter for PostScript and PDF
brew "pdf2svg"

# Mac App Store Applications
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997
mas "Darkroom", id: 953286746 # Photo editor
mas "1Blocker", id: 1365531024 # Block ads
mas "Hush", id: 1544743900 # Block cookie/other annoyances
mas "Vinegar", id: 1591303229 # Native video player for YouTube
mas "Coupert", id: 1531442936 # Deal finder
mas "Pause", id: 1599313358 # 20 second break every 20 mins
mas "Tailscale", id: 1475387142 # Remote access
