tap "oven-sh/bun"

# Core Utilities
brew "git"
brew "gh" # GitHub CLI
brew "vercel-cli" 

# Toolchains
brew "python@3.12"
brew "rustup-init"
brew "llvm" # Required for Rust
brew "rust" # Run "brew info rust" for instructions on linking rustup with brew
brew "uv" # Python package manager
brew "ruff" # Python linter
brew "solidity" # Ethereum smart contracts

# Node.js & Front-End Development
brew "node"
brew "bun" # Package manager

# Research
brew "scipy"
brew "jupyterlab"
cask "mactex-no-gui"
cask "zotero"
cask "obsidian"

# Fonts
cask "font-geist"
cask "font-geist-mono"
cask "font-new-york"
cask "font-sf-pro"
cask "font-sf-mono"
cask "font-stix-two-text"
cask "font-stix-two-math"

# Productivity
cask "warp" # Better terminal
cask "linear-linear" # Issue manager
cask "lookaway" # Take a break from looking at the screen
cask "superwhisper" # Dictation
brew "thefuck" # Helps when you mistype something in the terminal

# Code Editors
cask "cursor"
cask "zed"

# Design Tools
cask "sketch"

# AI tools
cask "claude"
cask "chatgpt" 
brew "ollama" # Offline LLM

# CLI tools 
brew "bottom" # System monitoring
brew "zoxide" # Navigate filesystem faster
brew "lsd" # Colourful ls
brew "fzf" # File finder

# Misc
cask "protonvpn"
cask "alcove"

# Mac App Store Applications
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997
mas "Darkroom", id: 953286746
mas "1Blocker", id: 1365531024
mas "Hush", id: 1544743900
mas "Vinegar", id: 1591303229
mas "Coupert", id: 1531442936
mas "MeetingBar", id: 1532419400
mas "Daily", id: 686910553
